In this notebook I outline the basics of creating and using functions in Python. I will brefly describe what a function is, demonstrate a function's basic syntax, and then dive deep into function usage. The objective is for students to grasp the conept of how functions are used so they may be able to apply this convention into their code.

# Prerequisites

## Import the necessary packages.

First we will load the packages necessary to complete our demonstration. We will primarily be using the [Pandas](https://pandas.pydata.org/) package to help read in our data.

In [1]:
import pandas as pd # For loading the CSV file into a dataframe.

## Load some data.

For this demonstration, we will be using the Titannic dataset, which is readily available on [Kaggle.com](https://www.kaggle.com/datasets/brendan45774/test-file?resource=download). This dataset details the manfest of the RMS Titannic. It contains passenger demographic information as well as information relating to the passenger's economic status. For the purposes of this demonstration we will focus on how a function works in relation to the dataset.

To load the data we will read the titannic.csv file into dataframe using the Pandas package. We will cover dataframes later on in the course.

In [2]:
data = pd.read_csv('titanic.csv')

Once we have our dataframe loaded let's inspect it briefly to get a sense of the collumns and rows.

In [3]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

As we can see we now have our data in a neat, concise format. We are ready to dive in!

# Function Fundamentals

At the bare minimum function is defined as a collection of related statements that perform a specific task. The code in a function is reusable, meaning it can be called repeatedly to produce the same result over and over again. Functions are a very useful component of the related concept of object oriented programming.

## Basic Function Syntax

A function actually has seven parts, with some optional:
    
     1. The def keyword which marks the start of the function head.
     2. A function name to identify the function with.
     3. Optional parameters or arguments through which we pass values to a function.
     4. A colon (:) to mark the end of the end of the function header.
     5. An optional documentation string (commonly referred to as a docstring) to help describe what the function is doing.
     6. One or more valid Python statements that make up the function body.
     7. An optional return statement to return a value from the function. Note that there can be multiple return statements.
     
Here is what a function looks like.

In [5]:
def functionName (parameter = 'test'):
    '''
    This is the docstring for this function.
    It serves two purposes.
        1. It describes what the function is doing.
        2. It is what is displayed when the function is called with the 
            help function.
            
    This function capitolizes all characters in your sting.
    '''
    
    ## Valid Python statements go here. ##
    print('Converting ', parameter, ' to all caps!', sep = '')
    
    # We save the parameter string to a variable.
    string = parameter
    
    # Lastly we return the variable value from the function in all caps.
    return string.upper()

A couple of things to note here.

Notice how the parameter has a string assigned to it. This is the default value of the parameter. If the function is called without a parameter specified, then the parameter will be assigned with its default value for that instance of the function run.

The docstring is, while optional, used to provide information when calling the help function on your function. So it's generally best practice to include one along with regular comments in the statement section so that your code is readable and managable.

Note how I passed the parameter to a variable in the function and then used that variable to manipulate the data contained therein. This is a standard method of passing data into your functions.

Lastly, I return the capitolized version of the string that was passed into the function at the end. For usage, the function must be assigned to a variable for it to be output.

If we wish, we can also have multiple parameters in the function.

In [6]:
def functionName2 (parameter = 'test', parameter2 = 'test2'):
    '''
    This is the docstring for this function.
    It serves two purposes.
        1. It describes what the function is doing.
        2. It is what is displayed when the function is called with the 
            help function.
            
    This function capitolizes all characters in your sting.
    '''
    
    ## Valid Python statements go here. ##
    print('Converting ', parameter, ' to all caps!', sep = '')
    
    # We save the parameter string to a variable.
    string = parameter
    string2 = parameter2
    
    # Lastly we return the variable value from the function in all caps.
    return string.upper(), string2

## Function Usage

Let's check out the documentation for the function.

In [7]:
help(functionName)

Help on function functionName in module __main__:

functionName(parameter='test')
    This is the docstring for this function.
    It serves two purposes.
        1. It describes what the function is doing.
        2. It is what is displayed when the function is called with the
            help function.

    This function capitolizes all characters in your sting.

Notice that the function's docstring was displayed. This can be usedful in learning about a new function that you haven't used before. It's important to keep your functions well documented so other developers can pick up where you left off. This is part of that.

Let's call the function WITHOUT a parameter.

In [8]:
functionName()

Converting test to all caps!

'TEST'

Two things happened here. First, the default value was used for the parameter, and then passed through the function, outputting it in the console. Notice that I didn't assign it to a variable. Second, the contents of the print statement was printed out. What I am illustrating here is, that print can be very useful in diagnosing bfunction behavior.

Let's try it again, only this time I'm going to assign it to a variable, and then view that variable.

In [9]:
variable = functionName()
variable

Converting test to all caps!

'TEST'

Now we can call the variable in our code for reuse.

In [10]:
print('This is a ', variable, '!', sep = '')

This is a TEST!

We can also pass other strings to the function.

In [11]:
variable2 = functionName('Sky')
print('My name in all caps is, ', variable2, '.', sep = '')

Converting Sky to all caps!
My name in all caps is, SKY.

Let's call our second function with two variables.

In [12]:
variable3, variable4 = functionName2('foo', 'bar')
print(variable3)
print(variable4)

Converting foo to all caps!
FOO
bar

Note how we were able to pass in two strings, and return two values.

The point is, functions are a very convenient means of performing repetative tasks efficiently.

# Practical Function Demonstration.

We will now shift to a real demonstration of how useful functions are. We will use the Titannic dataset that we loaded into a dataframe earlier. Let's for a minute see what we can do with this dataset WITHOUT  a function.

Let's we want to concatenate together some columns. So we do so for a few rows like so.

In [13]:
concat1 = data['Name'][1] + ' | ' + data['Sex'][1] + ' | ' + str(data['Age'][1]) + ' years old. | '
concat1

'Wilkes, Mrs. James (Ellen Needs) | female | 47.0 years old. | '

In [14]:
concat2 = data['Name'][2] + ' | ' + data['Sex'][2] + ' | ' + str(data['Age'][2]) + ' years old. | '
concat2

'Myles, Mr. Thomas Francis | male | 62.0 years old. | '

In [15]:
concat3 = data['Name'][3] + ' | ' + data['Sex'][3] + ' | ' + str(data['Age'][3]) + ' years old. | '
concat3

'Wirz, Mr. Albert | male | 27.0 years old. | '

As we can see, while this is certainly doable, it is slightly tedious in nature. We have repeated our code three times manually to produce the same result. Let's see if we can arrive at the same result with a function.

In [16]:
def concatColumns (row):
    '''
    This function concatenates several rows together into a sting.
    
    Parameters:
        row = The row in the dataframe that is being concatenated.
    '''
    
    
    string = row[4] + ' | ' + row[5] + ' | ' + str(row[6]) + ' years old.'
    
    print(string)

Now that we have our process canned into a function, let's see what it can do.

For demonstration purposes, we will take a small subset of the data, say 20 rows. We will use a for loop on the dataframe and process each row using our function.

In [17]:
subset = data.sample(n = 20)

In [18]:
subset

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
261,1153,0,3,"Nilsson, Mr. August Ferdinand",male,21.0,0,0,350410,7.8542,NaN,S
284,1176,1,3,"Rosblom, Miss. Salli Helena",female,2.0,1,1,370129,20.2125,NaN,S
256,1148,0,3,"Mahon, Mr. John",male,NaN,0,0,AQ/4 3130,7.7500,NaN,Q
290,1182,0,1,"Rheims, Mr. George Alexander Lucien",male,NaN,0,0,PC 17607,39.6000,NaN,S
223,1115,0,3,"Karlsson, Mr. Einar Gervasius",male,21.0,0,0,350053,7.7958,NaN,S
265,1157,0,3,"Lyntakoff, Mr. Stanko",male,NaN,0,0,349235,7.8958,NaN,S
172,1064,0,3,"Dyker, Mr. Adolf Fredrik",male,23.0,1,0,347072,13.9000,NaN,S
241,1133,1,2,"Christy, Mrs. (Alice Frances)",female,45.0,0,2,237789,30.0000,NaN,S
230,1122,0,2,"Sweet, Mr. George Frederick",male,14.0,0,0,220845,65.0000,NaN,S
193,1085,0,2,"Lingane, Mr. John",male,61.0,0,0,235509,12.3500,NaN,Q
278,1170,0,2,"Ware, Mr. John James",male,30.0,1,0,CA 31352,21.0000,NaN,S
92,984,1,1,"Davidson, Mrs. Thornton (Orian Hays)",female,27.0,1,2,F.C. 12750,52.0000,B71,S
104,996,1,3,"Thomas, Mrs. Alexander (Thamine Thelma"")""",female,16.0,1,1,2625,8.5167,NaN,C
133,1025,0,3,"Thomas, Mr. Charles P",male,NaN,1,0,2621,6.4375,NaN,C
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
285,1177,0,3,"Dennis, Mr. William",male,36.0,0,0,A/5 21175,7.2500,NaN,S
113,1005,1,3,"Buckley, Miss. Katherine",female,18.5,0,0,329944,7.2833,NaN,Q
330,1222,1,2,"Davies, Mrs. John Morgan (Elizabeth Agnes Mary...",female,48.0,0,2,C.A. 33112,36.7500,NaN,S
260,1152,0,3,"de Messemaeker, Mr. Guillaume Joseph",male,36.5,1,0,345572,17.4000,NaN,S
171,1063,0,3,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C

In [19]:
for row in subset.itertuples():
    
    concatColumns(row)

Nilsson, Mr. August Ferdinand | male | 21.0 years old.
Rosblom, Miss. Salli Helena | female | 2.0 years old.
Mahon, Mr. John | male | nan years old.
Rheims, Mr. George Alexander Lucien | male | nan years old.
Karlsson, Mr. Einar Gervasius | male | 21.0 years old.
Lyntakoff, Mr. Stanko | male | nan years old.
Dyker, Mr. Adolf Fredrik | male | 23.0 years old.
Christy, Mrs. (Alice Frances) | female | 45.0 years old.
Sweet, Mr. George Frederick | male | 14.0 years old.
Lingane, Mr. John | male | 61.0 years old.
Ware, Mr. John James | male | 30.0 years old.
Davidson, Mrs. Thornton (Orian Hays) | female | 27.0 years old.
Thomas, Mrs. Alexander (Thamine Thelma")" | female | 16.0 years old.
Thomas, Mr. Charles P | male | nan years old.
Chaffee, Mrs. Herbert Fuller (Carrie Constance Toogood) | female | 47.0 years old.
Dennis, Mr. William | male | 36.0 years old.
Buckley, Miss. Katherine | female | 18.5 years old.
Davies, Mrs. John Morgan (Elizabeth Agnes Mary White)  | female | 48.0 years old.
de Messemaeker, Mr. Guillaume Joseph | male | 36.5 years old.
Zakarian, Mr. Ortin | male | 27.0 years old.

So we can see how useful a function can be.

We can also call functions from within functions. Let's modify our function a bit to make the names all caps.

In [20]:
def concatColumns2 (row):
    '''
    This function concatenates several rows together into a sting.
    
    Parameters:
        row = The row in the dataframe that is being concatenated.
    '''
    
    
    string = functionName(row[4]) + ' | ' + row[5] + ' | ' + str(row[6]) + ' years old.'
    
    print(string)

In [23]:
for row in subset.itertuples():
    
    concatColumns2(row)

Converting Nilsson, Mr. August Ferdinand to all caps!
NILSSON, MR. AUGUST FERDINAND | male | 21.0 years old.
Converting Rosblom, Miss. Salli Helena to all caps!
ROSBLOM, MISS. SALLI HELENA | female | 2.0 years old.
Converting Mahon, Mr. John to all caps!
MAHON, MR. JOHN | male | nan years old.
Converting Rheims, Mr. George Alexander Lucien to all caps!
RHEIMS, MR. GEORGE ALEXANDER LUCIEN | male | nan years old.
Converting Karlsson, Mr. Einar Gervasius to all caps!
KARLSSON, MR. EINAR GERVASIUS | male | 21.0 years old.
Converting Lyntakoff, Mr. Stanko to all caps!
LYNTAKOFF, MR. STANKO | male | nan years old.
Converting Dyker, Mr. Adolf Fredrik to all caps!
DYKER, MR. ADOLF FREDRIK | male | 23.0 years old.
Converting Christy, Mrs. (Alice Frances) to all caps!
CHRISTY, MRS. (ALICE FRANCES) | female | 45.0 years old.
Converting Sweet, Mr. George Frederick to all caps!
SWEET, MR. GEORGE FREDERICK | male | 14.0 years old.
Converting Lingane, Mr. John to all caps!
LINGANE, MR. JOHN | male | 61.0 years old.
Converting Ware, Mr. John James to all caps!
WARE, MR. JOHN JAMES | male | 30.0 years old.
Converting Davidson, Mrs. Thornton (Orian Hays) to all caps!
DAVIDSON, MRS. THORNTON (ORIAN HAYS) | female | 27.0 years old.
Converting Thomas, Mrs. Alexander (Thamine Thelma")" to all caps!
THOMAS, MRS. ALEXANDER (THAMINE THELMA")" | female | 16.0 years old.
Converting Thomas, Mr. Charles P to all caps!
THOMAS, MR. CHARLES P | male | nan years old.
Converting Chaffee, Mrs. Herbert Fuller (Carrie Constance Toogood) to all caps!
CHAFFEE, MRS. HERBERT FULLER (CARRIE CONSTANCE TOOGOOD) | female | 47.0 years old.
Converting Dennis, Mr. William to all caps!
DENNIS, MR. WILLIAM | male | 36.0 years old.
Converting Buckley, Miss. Katherine to all caps!
BUCKLEY, MISS. KATHERINE | female | 18.5 years old.
Converting Davies, Mrs. John Morgan (Elizabeth Agnes Mary White)  to all caps!
DAVIES, MRS. JOHN MORGAN (ELIZABETH AGNES MARY WHITE)  | female | 48.0 years old.
Converting de Messemaeker, Mr. Guillaume Joseph to all caps!
DE MESSEMAEKER, MR. GUILLAUME JOSEPH | male | 36.5 years old.
Converting Zakarian, Mr. Ortin to all caps!
ZAKARIAN, MR. ORTIN | male | 27.0 years old.

So we can see how the functions can ver very useful.